#### CircuitNumberingOption Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all the circuit numbering options.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public enum CircuitNumberingOption ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration CircuitNumberingOption ``` |

| Visual C++ |
| --- |
| ``` public enum class CircuitNumberingOption ``` |

# Members

| Member name | Description |
| --- | --- |
| Default | Circuit numbering type is starting from one. |
| Continuous | Circuit numbering type is continuous from its parent panel. |

# See Also

Autodesk.Revit.DB.Electrical Namespace